podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SCB_S32K14x.svd.xml
            <register>
               <name>CCR</name>
               <description>Configuration and Control Register</description>
               <addressOffset>0xD14</addressOffset>
               <fields>
                  <field>
                     <name>NONBASETHRDENA</name>
                     <description>Indicates how the processor enters Thread mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Processor can enter Thread mode only when no exception is active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Processor can enter Thread mode from any level under the control of an EXC_RETURN value</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>USERSETMPEND</name>
                     <description>Enables unprivileged software access to the STIR</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UNALIGN_TRP</name>
                     <description>Enables unaligned access traps</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Do not trap unaligned halfword and word accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Trap unaligned halfword and word accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIV_0_TRP</name>
                     <description>Enables faulting or halting when the processor executes an SDIV or UDIV instruction with a divisor of 0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Do not trap divide by 0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Trap divide by 0</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BFHFNMIGN</name>
                     <description>Enables handlers with priority -1 or -2 to ignore data BusFaults caused by load and store instructions</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Data bus faults caused by load and store instructions cause a lock-up</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Handlers running at priority -1 and -2 ignore data bus faults caused by load and store instructions</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STKALIGN</name>
                     <description>Indicates stack alignment on exception entry</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>4-byte aligned</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>8-byte aligned</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHPR1</name>
               <description>System Handler Priority Register 1</description>
               <addressOffset>0xD18</addressOffset>
               <fields>
                  <field>
                     <name>PRI_4</name>
                     <description>Priority of system handler 4, MemManage</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_5</name>
                     <description>Priority of system handler 5, BusFault</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_6</name>
                     <description>Priority of system handler 6, UsageFault</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHPR2</name>
               <description>System Handler Priority Register 2</description>
               <addressOffset>0xD1C</addressOffset>
               <fields>
                  <field>
                     <name>PRI_11</name>
                     <description>Priority of system handler 11, SVCall</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHPR3</name>
               <description>System Handler Priority Register 3</description>
               <addressOffset>0xD20</addressOffset>
               <fields>
                  <field>
                     <name>PRI_12</name>
                     <description>Priority of system handler 12, DebugMonitor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_14</name>
                     <description>Priority of system handler 14, PendSV</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_15</name>
                     <description>Priority of system handler 15, SysTick exception</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHCSR</name>
               <description>System Handler Control and State Register</description>
               <addressOffset>0xD24</addressOffset>
               <fields>
                  <field>
                     <name>MEMFAULTACT</name>
                     <description>MemManage exception active bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>exception is not active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>exception is active</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="MEMFAULTACT" > <name>BUSFAULTACT</name> <description>BusFault exception active bit</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="MEMFAULTACT" > <name>USGFAULTACT</name> <description>UsageFault exception active bit</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="MEMFAULTACT" > <name>SVCALLACT</name> <description>SVCall active bit</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="MEMFAULTACT" > <name>MONITORACT</name> <description>Debug monitor active bit</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="MEMFAULTACT" > <name>PENDSVACT</name> <description>PendSV exception active bit</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="MEMFAULTACT" > <name>SYSTICKACT</name> <description>SysTick exception active bit</description> <bitOffset>11</bitOffset> </field>
                  <field>
                     <name>USGFAULTPENDED</name>
                     <description>UsageFault exception pending bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>exception is not pending</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>exception is pending</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="USGFAULTPENDED" > <name>MEMFAULTPENDED</name> <description>MemManage exception pending bit</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="USGFAULTPENDED" > <name>BUSFAULTPENDED</name> <description>BusFault exception pending bit</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="USGFAULTPENDED" > <name>SVCALLPENDED</name> <description>SVCall pending bit</description> <bitOffset>15</bitOffset> </field>
                  <field>
                     <name>MEMFAULTENA</name>
                     <description>MemManage enable bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>disable the exception</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>enable the exception</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="MEMFAULTENA" > <name>BUSFAULTENA</name> <description>BusFault enable bit</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="MEMFAULTENA" > <name>USGFAULTENA</name> <description>UsageFault enable bit</description> <bitOffset>18</bitOffset> </field>
               </fields>
            </register>
